       01 GLI-INTERNAL-TRANSACTION.
            05  GLI-TRAILER-AREA.
            10 GLI-TR-RECORD-TYPE               PIC X(02).
            10 GLI-TR-RECORD-SEQUENCE           PIC X(19).
            10 GLI-TR-RECORD-COUNT              PIC X(19).
            10 GLI-TR-TOT-CREDIT-AMOUNT         PIC X(18).
            10 GLI-TR-TOT-DEBIT-AMOUNT          PIC X(18).
            10 FILLER                          PIC X(816).
